configuration/src/Catalogs/ИдентификаторыОбъектовМетаданных/ИдентификаторыОбъектовМетаданных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ИдентификаторыОбъектовМетаданных</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>Документ</name>
      <description>Документ</description>
    </items>
    <items>
      <name>Константа</name>
      <description>Константа</description>
    </items>
    <items>
      <name>Обработка</name>
      <description>Обработка</description>
    </items>
    <items>
      <name>ОбщаяКоманда</name>
      <description>ОбщаяКоманда</description>
    </items>
    <items>
      <name>ОбщаяФорма</name>
      <description>ОбщаяФорма</description>
    </items>
    <items>
      <name>Отчет</name>
      <description>Отчет</description>
    </items>
    <items>
      <name>Перечисление</name>
      <description>Перечисление</description>
    </items>
    <items>
      <name>ПланВидовХарактеристик</name>
      <description>ПланВидовХарактеристик</description>
    </items>
    <items>
      <name>ПланОбмена</name>
      <description>ПланОбмена</description>
    </items>
    <items>
      <name>РегистрНакопления</name>
      <description>РегистрНакопления</description>
    </items>
    <items>
      <name>РегистрСведений</name>
      <description>РегистрСведений</description>
    </items>
    <items>
      <name>Справочник</name>
      <description>Справочник</description>
    </items>
  </predefined>
  <attributes>
    <name>Идентификатор</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>36</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Использование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПолноеИмяФормы</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>200</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыМетаданных</types>
    </type>
  </attributes>
</mdclass:Catalog>

configuration/src/Catalogs/ИдентификаторыОбъектовМетаданных/Forms/ФормаСписка/Module.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	НовыйОтбор = Список.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйОтбор.ПравоеЗначение = Ложь;
	НовыйОтбор.Использование = Истина;
	
	НовыйОтбор = Дерево.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	НовыйОтбор.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("ПометкаУдаления");
	НовыйОтбор.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	НовыйОтбор.ПравоеЗначение = Ложь;
	НовыйОтбор.Использование = Истина;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКоманд

&НаКлиенте
Процедура ПоказыватьПомеченныеНаУдаление(Команда)
	
	Список.Отбор.Элементы[0].ПравоеЗначение = НЕ Список.Отбор.Элементы[0].ПравоеЗначение;
	Дерево.Отбор.Элементы[0].ПравоеЗначение = НЕ Дерево.Отбор.Элементы[0].ПравоеЗначение;
	
КонецПроцедуры

&НаКлиенте
Асинх Процедура Синхронизировать(Команда)
	
	ТекстВопроса = "Загрузить ""ConfigDumpInfo.xml"" вручную?";
	ОтветНаВопрос = Ждать ВопросАсинх(ТекстВопроса, РежимДиалогаВопрос.ДаНетОтмена, , КодВозвратаДиалога.Да);
	
	Если ОтветНаВопрос = КодВозвратаДиалога.Да Тогда
		ПараметрыДиалога = Новый ПараметрыДиалогаПомещенияФайлов(, Ложь, "*.xml");
		ОписаниеФайла = Ждать ПоместитьФайлНаСерверАсинх(, , , ПараметрыДиалога, УникальныйИдентификатор);
		
		Если ОписаниеФайла <> Неопределено Тогда
			СинхронизироватьНаСервере(ОписаниеФайла.Адрес)
		КонецЕсли;
		
	ИначеЕсли ОтветНаВопрос = КодВозвратаДиалога.Нет Тогда
		СинхронизироватьНаСервере();
	Иначе
		Возврат;
	КонецЕсли;
	
	Элементы.Список.Обновить();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
Процедура СинхронизироватьНаСервере(Знач АдресХранилища = Неопределено)
	
	СоставКонфигурации = Неопределено;
	
	Если АдресХранилища <> Неопределено Тогда
		ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресХранилища);
		
		ЧтениеДанных = Новый ЧтениеДанных(ДвоичныеДанные, КодировкаТекста.UTF8);
		ЧтениеТекста = Новый ЧтениеТекста(ЧтениеДанных.ИсходныйПоток(), КодировкаТекста.UTF8);
		СоставКонфигурации = ЧтениеТекста.Прочитать();
		ЧтениеТекста.Закрыть();
		ЧтениеДанных.Закрыть();
	КонецЕсли;
	
	Справочники.ИдентификаторыОбъектовМетаданных.СинхронизироватьИдентификаторыМетаданных(СоставКонфигурации);
	
КонецПроцедуры

#КонецОбласти
